In [2]:
import numpy as np
import pandas as pd

In [7]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df['col2'].unique() #returns an array of unique values

array([444, 555, 666], dtype=int64)

In [10]:
len(df['col2'].unique()) #number of unique values

3

In [11]:
df['col2'].nunique() #nunique method returns the number of unique values

3

In [12]:
df['col2'].value_counts() #returns how many times each value appears

444    2
555    1
666    1
Name: col2, dtype: int64

In [13]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [14]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [15]:
def times2(x):
    return x*2

In [16]:
df['col1'].sum()

10

In [17]:
df['col1'].apply(times2) # .apply() method allows you to apply a custom function to each element in a row or column

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
df['col3'].apply(len) #can also use .apply() method for built in functions
                      #notice it applys to every element individually

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [21]:
len(df['col3'])  #the len function applies to the column as a whole

4

In [22]:
# .apply is particualrly useful for using with lambda expressions

In [23]:
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [24]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df.drop('col1',axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [26]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
df.columns  #requests the attribute columns.

Index(['col1', 'col2', 'col3'], dtype='object')

In [28]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [31]:
df.sort_values('col2') #notice how the index stays attached to its original row

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [33]:
df.isnull() #all False as there is no NaN's in the dataframe

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [35]:
#pivot tables

In [40]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [41]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [43]:
#the values in the A and B columns are now the index values
#the values in column C are now the new Columns 
#the values in column D is the data in the new dataframe

In [45]:
df_pivot = df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'])

In [46]:
df_pivot

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [50]:
df_pivot.loc['bar'].loc['one']

C
x    4.0
y    1.0
Name: one, dtype: float64

In [51]:
df_pivot.fillna('No Match')

C               x         y
A   B
bar one         4         1
    two  No Match         5
foo one         1         3
    two         2  No Match